book_DB/app/controllers/posts_controller.rb

  def index
    @results = @q.result
    @posts = Post.all.order(created_at: :desc)
---
SELECT "posts".* FROM "posts" ORDER BY "posts"."created_at" DESC

  def show
    @post = Post.find_by(id: params[:id])
    new_browse = @post.browse_histories.new
    new_browse.user_id = @current_user.id
    new_browse.post_id = @post.id
    new_browse.post_title = @post.title
    new_browse.post_author = @post.author
    if @current_user.browse_histories.exists?(post_id: "#{params[:id]}")
       old_browse = @current_user.browse_histories.find_by(post_id: "#{params[:id]}")
       old_browse.destroy
    end

    new_browse.save

    browse_stock_limit = 5
    newerlist = @current_user.browse_histories.all
    if newerlist.count > browse_stock_limit
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 11], ["LIMIT", 1]]
SELECT  "browse_histories".* FROM "browse_histories" WHERE "browse_histories"."user_id" = ? AND "browse_histories"."post_id" = ? LIMIT ?  [["user_id", 5], ["post_id", 11], ["LIMIT", 1]]
SELECT  1 AS one FROM "browse_histories" WHERE "browse_histories"."user_id" = ? AND "browse_histories"."post_id" = ? LIMIT ?  [["user_id", 5], ["post_id", 12], ["LIMIT", 1]]
SELECT  "browse_histories".* FROM "browse_histories" WHERE "browse_histories"."user_id" = ? AND "browse_histories"."post_id" = ? LIMIT ?  [["user_id", 5], ["post_id", 12], ["LIMIT", 1]]
DELETE FROM "posts" WHERE "posts"."id" = ?  [["id", 1]]
DELETE FROM "browse_histories" WHERE "browse_histories"."id" = ?  [["id", 66]]
INSERT INTO "posts" ("content", "created_at", "updated_at", "title", "author", "user_id") VALUES (?, ?, ?, ?, ?, ?)  [["content", "公安の犬・デンジの戦いは新たな局面へ!!"], ["created_at", "2021-01-18 17:55:57.215771"], ["updated_at", "2021-01-18 17:55:57.215771"], ["title", "チェンソーマン2"], ["author", "藤本タツキ"], ["user_id", 5]]
INSERT INTO "browse_histories" ("created_at", "updated_at", "user_id", "post_id", "post_title", "post_author") VALUES (?, ?, ?, ?, ?, ?)  [["created_at", "2021-01-19 15:02:29.547033"], ["updated_at", "2021-01-19 15:02:29.547033"], ["user_id", 5], ["post_id", 11], ["post_title", "チェンソーマン1"], ["post_author", "藤本タツキ"]]
SELECT "browse_histories".* FROM "browse_histories" WHERE "browse_histories"."user_id" = ?  [["user_id", 5]]
SELECT COUNT(*) FROM "browse_histories" WHERE "browse_histories"."user_id" = ?  [["user_id", 5]]

  def create
    @post = Post.new(
      title: params[:title],
      author: params[:author],
      content: params[:content],
      user_id: @current_user.id
    )
    if @post.save
      new_regist = @post.regist_histories.new
      new_regist.user_id = @current_user.id
      new_regist.post_id = @post.id
      new_regist.post_title = @post.title
      new_regist.post_author = @post.author

      new_regist.save

      regist_stock_limit = 5
      newerregist = @current_user.regist_histories.all
      if newerregist.count > regist_stock_limit
---
INSERT INTO "posts" ("content", "created_at", "updated_at", "title", "author", "user_id") VALUES (?, ?, ?, ?, ?, ?)
INSERT INTO "regist_histories" ("created_at", "updated_at", "user_id", "post_id", "post_title", "post_author") VALUES (?, ?, ?, ?, ?, ?)  [["created_at", "2021-01-19 15:16:31.123090"], ["updated_at", "2021-01-19 15:16:31.123090"], ["user_id", 5], ["post_id", 13], ["post_title", "さよなら妖精"], ["post_author", "米澤穂信"]]
SELECT COUNT(*) FROM "regist_histories" WHERE "regist_histories"."user_id" = ?  [["user_id", 5]]

  def edit
    @post = Post.find_by(id: params[:id])
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 0], ["LIMIT", 1]]

  def update
    @post = Post.find_by(id: params[:id])
    @post.content = params[:content]
    @post.title = params[:title]
    @post.author = params[:author]
    if @post.save
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 11], ["LIMIT", 1]]
UPDATE "posts" SET "title" = ?, "author" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["title", "チェンソーマン1"], ["author", "藤本タツキ"], ["updated_at", "2021-01-18 18:02:39.894073"], ["id", 11]]

  def destroy
    @post = Post.find_by(id: params[:id])
    @post.destroy
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "posts" WHERE "posts"."id" = ?  [["id", 1]]