book_DB/app/controllers/posts_controller.rb

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 11], ["LIMIT", 1]]
UPDATE "posts" SET "title" = ?, "author" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["title", "チェンソーマン1"], ["author", "藤本タツキ"], ["updated_at", "2021-01-18 18:02:39.894073"], ["id", 11]]
---
  def update
    @post = Post.find_by(id: params[:id])
    @post.content = params[:content]
    if @post.save

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 11], ["LIMIT", 1]]
---
  def destroy
    @post = Post.find_by(id: params[:id])