book_DB/app/controllers/users_controller.rb

  def show
    @user = User.find_by(id: params[:id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]

  def create
    @user = User.new(
      name: params[:name],
      email: params[:email],
      password: params[:password]
    )
    if @user.save
---
INSERT INTO "users" ("name", "email", "created_at", "updated_at", "password") VALUES (?, ?, ?, ?, ?)  [["name", "test2"], ["email", "12345"], ["created_at", "2021-01-18 13:27:22.874806"], ["updated_at", "2021-01-18 13:27:22.874806"], ["password", "test2"]]

  def login
    @user = User.find_by(email: params[:email], password: params[:password])
---
SELECT  "users".* FROM "users" WHERE "users"."email" = ? AND "users"."password" = ? LIMIT ?  [["email", "da"], ["password", "da"], ["LIMIT", 1]]