book_DB/app/views/users/show.html.erb

  <h1>最近追加した本</h1>
    <% @user.regist_histories.each do |regist_history| %>
---
SELECT "regist_histories".* FROM "regist_histories" WHERE "regist_histories"."user_id" = ?  [["user_id", 5]]

  <h1>最近検索した本</h1>
  <% @user.browse_histories.each do |browse_history| %>
---
SELECT "browse_histories".* FROM "browse_histories" WHERE "browse_histories"."user_id" = ?  [["user_id", 5]]