book_DB/app/models/post.rb

  def user
  	return User.find_by(id: self.user_id)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]